{
    "Aug": {
        "INDEX_ $COMPQ": {
            "Quarterly": [
                {
                    "9": "This is the 3rd candle of the year. This is the 2nd month of this candle and it will not close until the last trading day of September. The candle opened at the close of the previous candle, it has moved lower,  and is currently a red candle (candle not closed). By this point in a quarterly candle formation, it is unlikely to change significantly before the candle is closed, just the size of the body and wick but not likely the color. The TBB is rising. The up auto-wave lines is attached to the currently forming candle. The 21MA is rising. The 13, 21, 34, and 55MAs are all rising and potential support areas. The BBB is also rising and potential support. The Christmas Cross lines have the red above the green and both rising. The SRSI lines are rising with the red line above the 50-level and the green below the 50-level. I have a downward channel drawn on the SRSI with the top line connecting points at 7/01/2018 and 10/01/2021. The red SRSI line is approaching that line but will not impact in this quarter. There is a potential bearish divergence forming on the SRSI and MACD (remember, this is a quarterly chart and it will take several quarters to form… so likely next year). The red MACD lines are rising with the red line decreasing the distance between the two lines. The green DM line is cocked below the 8-level. This chart is still wanting to go higher but starting to tire of the rise."
                }
            ],
            "Monthly": [
                {
                    "9": "The candle opened near close of the last candle and has moved lower, currently forming a red candle. The TBB is rising. The up auto-wave line is formed and is attached to the previous candle. The 21MA is rising. The 13, 21, 34, 55, 89, and 144MAs are all potential support areas.  The BBB is rising. The red Christmas Cross line is starting to slightly decline above the rising green line. The SRSI lines are above the 80-level with the red declining below the slightly declining green line. The declining red MACD line is above the rising green line and is decreasing the distance between the two lines. The red DM line is declining above the rising green line. The green line fired today (candle is not closed). The conditions on this time-frame are potentially positioning for a decline in the coming MONTHS though that downward movement has barely started at this point. There are lessening permissions for upward movements. Sideways (slightly up and down) to lower are the permissions here to the smaller charts currently, in my opinion. The 21MA is rising and the candles will have to decline to attack it at some point over the months ahead. Remember, it is a monthly chart and doesn’t change directions quickly."
                }
            ],
            "Weekly": [
                {
                    "9": "This is day 5 of 5 for this candle. The candle is now closed. The candle opened gapped down below the previous candle close, moved higher, closing as a white candle. The down auto-wave has formed and is attached to this closed candle. The TBB is flattening (maybe slightly declining). The 21MA is flattening. The 55, 89, 144, 233, 377, and 610MAs are all rising below as potential support (pushing higher). The BBB is slightly rising. The red Christmas Cross line is declining below the flattening green line. The red SRSI line is declining below the declining green line, below the 20-level. The red line is at 13.26. The green line is declining at 57.64. The red MACD line is declining and below the declining green line. The red DM line is declining below the green line, with the red close to being cocked. The movement lower to attack the 21MA is now below the 21MA and now will be about pulling in lower in the weeks ahead. There are NO direct permissions to move higher. The permissions for the smaller charts are to move lower or sideways (up / bouncing or down as needed) in my opinion."
                }
            ],
            "3-Day:": [
                {
                    "9": "This is day 1 of 3 for this candle. Today’s candle is simply the daily candle’s movement represented in the context of this 3-Day chart time-frame. The candle opened near the previous candle close, moved higher, and is currently forming a small white candle above the 55MA (candle not closed). The down auto-wave is formed but has not shifted to the right at this point. The TBB is flattening. The 21MA is flattening (following a rise). The 55, 89, 144, 233, and 377MAs are all rising and potential support (pushing higher). The BBB is"
                }
            ],
            "Daily": [
                {
                    "9": "The candle opened near the close of the previous candle, moved a little higher, closing as a small white candle above the 144MA. The 21MA is declining. The 21MA is declining and crossing below the 55MA. The 13, 21, 34, 55, and 89MAs are potential resistance. The 144, 233, and 377, 610, and 987MAs are all still pressing higher from below as potential support. The down auto-wave has formed but has not shifted to the right at this point. The TBB is declining. The BBB is slightly declining. The red Christmas Cross line is rising and"
                }
            ],
            "233": [
                {
                    "9": "Today the first candle opened near the previous candle’s close, moved higher, and closed as a white candle. The 2nd candle opened near the close of the first, barely moved, closing as a doji candle on / below the 233MA. The TBB is declining. The BBB is declining. The down auto-wave is formed but has not shifted to the right at this point. The 21 is declining. The red Christmas Cross line is flattening above the slightly rising green line. The SRSI lines are above the 50-level. The red line is rising above the 80-level, above the rising green, ending at 81.77 with the green rising above the 50-level at 57.73. The red MACD line is rising above the rising green line. The red DM line is rising above the declining green line (both in the noise). To me, this looks like it’s likely to move sideways below / along the 233MA and 21MA in my opinion. The biggest charts are providing permission to the downside with no direct permissions to move higher other than as a sideways up / down movement. This 233 chart just seems likely to move sideways for a little while between"
                }
            ],
            "144": [
                {
                    "9": "Today the first candle opened just below the previous candle close, moved higher, closing as a tiny white candle on the 377MA. The 2nd candle opened near the close of the first, moved a higher, closing as a tiny white candle. The last candle opened near the close of the 2nd, moved a bit higher, closing as a tiny white candle on the 377MA. The up auto-wave is formed and is attached to the 2nd candle today on this time-frame. The 21MA is declining. The TBB is declining. The BBB is rising. The red Christmas Cross line is flattening above"
                }
            ]
        },
        "GS": {
            "Quarterly": [
                {
                    "9": "This is the 3rd quarterly candle of the year. It opened near the close of the previous candle and has moved higher currently forming a white candle on the rising TBB (candle not closed). By this point in a quarterly candle formation, it is unlikely to change significantly before the candle is closed, just the size of the body and wick but not likely the color. The up auto-wave is formed and is attached to this forming candle. The TBB is rising. The 21MA is rising. The 13, 21, 34, 55, and 89MAs are all rising and well below as potential support. The BBB is slightly rising but may be starting to flatten. The red Christmas Cross line is rising above the rising green Christmas Cross line. The SRSI lines are near the 80-level with the red line rising above the 80-level and the rising green line. The red MACD line is rising above the rising green line and starting to increase the distance between the two lines. The rising red DM line is well above the green line. The green line is cocked. This chart does not seem to be tiring of the rise and currently not preparing for a decline in the near future. Though smaller charts can move up and down as needed, the permissions from this quarterly chart is to the upside or sideways (up and down as needed), in my opinion. So, in my opinion, the permission from this time-fame is sideways (up or down as needed) more than down for the smaller charts."
                }
            ],
            "Monthly": [
                {
                    "9": "The candle opened near the close of the previous candle, moved lower, and is currently forming a red candle, possibly a tweezer top (candle not closed). The up auto-wave line is formed and is attached to the previous candle. The TBB is rising. The BBB is declining. The 21MA is rising. The 13, 21, 34, 55, 89, 144, 233MAs are all rising and potential support. The red Christmas Cross line is rising above the rising green. The SRSI lines are both above the 80-level. The red line is declining below the flattening green line. The red MACD line is flattening above the rising green line. The red DM line bent lower well above the green. The green line bent higher as is still cocked at 8.91. This time-frame seems to be tiring of the up and starting to provide signals of some potential sideways (auto-wave, TBB, SRSI, green DM line) with the MACD and 21MA saying the up isn’t over. There are no specific permissions in place to go higher or lower at this point on this time-frame. Sideways (up or down as needed) and then eventually lower to test potential support areas… but this is a monthly chart and it will take months to reach the rising 13MA let alone the rising 21MA. Permissions to the smaller charts seem to be to move up or down as needed (with a leaning to the downside), in my opinion."
                }
            ],
            "8-Day": [
                {
                    "9": "Today is day 7 of 8 for this candle. The candle opened near the close of the previous candle and moved lower, currently forming a large red candle below the TBB. The TBB is starting to flatten. The up auto-wave has formed and is attached to the previous candle. The 21MA is rising. The 13, 21, 34, 55, 89, 144, 233, and 377MAs are all below and potential support. The BBB is rising. The slightly declining red Christmas Cross line is above the slightly rising green line. The SRSI lines are near the 80-level. The red line is declining, below the declining green, below the 80-level, and currently at 73.58. There is a bearish divergence formed on the SRSI. The declining green line is currently at 75.14. The red MACD line is bent lower just above the rising green line. The red DM line is declining and trying to cross below the rising green line. The indications for this chart are suggesting the move lower toward the summer lows has started. I wouldn’t be surprised to see some lower movement toward the rising 13MA to test it as potential support. Again, this is an 8-Day chart and it may take several of these candles to get there. Permissions for the smaller charts below are to move sideways (up and down) as needed to test potential support or resistance areas of individual charts with a leaning lower... in my opinion."
                }
            ],
            "Weekly": [
                {
                    "9": "This is day 5 of 5 of this candle. The candle is now closed. The candle opened gapped down below the previous candle’s close, moved higher, closing as a large white candle. The TBB is starting to flatten. The BBB is rising. The down auto-wave is formed and is attached to this closed candle. The 21MA is rising. The 13MA is rising above the 21MA. The rising 21, 34MA, 55MA, and BBB are below as potential support. The declining red Christmas Cross line is trying to cross below the rising green Christmas Cross line. The SRSI lines are below the 80-level. The red line is declining below the flattening green, above the 50-level, at 59.79 with the green line declining at 75.47. The red MACD line is flat, below the slightly declining green line. The red DM line is declining below the rising green line. Tiring of the rise, the movement lower is just starting on this time-frame... so the permissions for smaller charts are to move lower or sideways (up and down as needed). In my opinion this chart shows that lower to test potential support areas or sideways along those potential support areas in the coming weeks (like the 21MA and maybe the 34MA) is the most likely movement for now. So, in my opinion, based on the permissions from the larger charts, the permission from this chart to the smaller charts is to move sideways or lower to test their specific potential support areas... so, up and down as needed, from those specific support / resistance areas."
                }
            ],
            "3-Day": [
                {
                    "9": "This is day 1 of 3 for this candle. Today’s candle is simply the daily candle’s movement represented in the context of this 3-Day chart time-frame. This candle opened near the previous candle’s close, moved higher, and is currently forming a white candle above the 13MA. The TBB is rising. The BBB may be starting to flatten. The down auto-wave line has formed but has not shifted to the right at this point. The 21MA is possibly starting to flatten. The 21MA, 34MA, and BBB are below as potential support. The 55, 89, 144, 233, 377,"
                }
            ],
            "Daily": [
                {
                    "9": "Today the candle opened near yesterday’s close, moved higher, closing as a white candle on / below the 21MA. The down auto-wave is formed but has not shifted to the right at this point. The 21 is slightly flat (following a rise). The TBB is flat. The BBB is flat. The red Christmas Cross line is rising above the declining green Christmas Cross line. The SRSI lines are near the 20-level. The red line is rising above the declining green line. The red line ending today above the 20-level at 32.33 with the declining green ending at 15.60. The red"
                }
            ],
            "233": [
                {
                    "9": "The first candle opened near the previous candle’s close, moved higher, closing as a white candle on the 34 and 21MAs. The 2nd candle opened near the close of the first, moved a little lower, and closed as a red candle just on the 34 and 21MA. The TBB is slightly declining. The BBB is flattening. The 21MA is slightly declining. The down auto-wave is formed but has not shifted to the right at this point. The red Christmas Cross line is rising above the rising green line. The SRSI lines are near the 50-level. The rising red line is above the 50-level, above the rising green line, ending today at 61.56 with the rising green line below the 50-level, ending today at 48.31. The rising red MACD line is above the rising green line. The red DM line is declining above the declining green line (both in the noise). With the permissions from the larger charts to move sideways, this 233-chart may move more sideways along the 21, 34, and 55MAs before likely moving lower again toward recent lows or below in my opinion. The permissions for smaller charts is sideways (up or down as needed) then likely continuing lower back to the 89 or maybe the 144MA... in my opinion."
                }
            ],
            "144": [
                {
                    "9": "Today the 1st candle opened a bit below the close of the previous candle, moved higher, closing as a white candle on / below the 55MA. The 2nd candle opened near the close of the first, moved a tiny bit lower, closing as tiny red candle on / below the 55MA. The last candle opened near the close of the 2nd, moved a tiny bit higher, closing as a tiny white candle on the 55MA. The up auto-wave is formed and is attached to the 2md candle today on this time-frame. The 21MA is declining. The TBB is declining. The BBB is rising. The"
                }
            ]
        }
    }
}