{
    "April": {
        "$INDU": {
            "Quarterly": {
                "1": "Today is the start of this candle. So, today is simply the daily’s chart’s candle represented in the context of the quarterly chart time-frame. At this point we can’t really say anything about this specific candle. The candle is near the rising TBB. The candle (as well as the previous candle) is above my highest purple line. The up auto-wave is formed and attached to the recently completed candle. The 21, 34, 55, 89, and 144MAs are all rising. The BBB is rising. The SRSI lines are both rising with the red above the 50-level and the green line still below that level. The MACD lines are rising with the red line moving basically parallel with the green. The green DM line is cocked well below the 8-level. The green DM line is the only thing suggesting the a down is coming at some point in the future on this time frame."
            },
            "Monthly": {
                "1": "Today is the beginning of this candle. So, today is simply the daily’s chart’s candle represented in the context of the monthly chart time-frame. The candle is currently red but it’s a down day (doesn’t mean anything at this point). The candles have been tracking the rising TBB. The up auto-wave has formed and attached to the previous candle. The 21MA is rising and just starting to cross the 34MA higher. The 21, 34, 55, 89, 144, 233, and 377MAs are all pressing higher. The BBB is flat. The SRSI lines are above 80. The red line is just turning slightly lower from near 100. The green line is still rising. The MACD lines are rising. The red line reduced the distance between the two lines by reducing the trajectory of the rise. The green DM line is cocked near the 8-level. The conditions on this time-frame are potentially positioning for a decline in the coming months and therefore are providing lessening permissions for upward movements and growing permissions for movements to the downside though the down has not started here yet… it appears to be coming. Remember, it is a monthly charts and doesn’t change directions quickly."
            },
            "8-Day": {
                "1": "This is day 5 of 8 for this candle. The candles have been moving sideways to slightly higher for the past 6 candlesunder the rising TBB. The forming candle is currently a small white candle. The up auto-wave is formed and attached to the previous candle. The SRSI lines are above the 80-level with both near 100, red slightly higher than the green, and moving sideways. The MACD lines have been on the rise but the red line is moving flat and the rising green line is also starting to turn flat. The green DM line is cocked well below the 8-level and sitting on my super low yellow line at 2.08. The conditions are in place for a decline. Though not really moving lower yet, to me this chart time-frame is providing some permission for additional downward movements. We also have to realize Super-6 we are still in Super-6 and the it’s earning season."
            },
            "Weekly": {
                "1": "Today is a start of this candle (1 of 5). Today is just the daily candle’s movement represented in the context of this weekly chart time-frame. For the most part the candles have been flat to slightly rising since the end of January. The up auto-wave line is formed but has not shifted to the right at this point. The TBB is flat to just slightly lower. The 21, 34, 55, 89, 144, and 233MAs are all pressing higher. The 89 is crossing the 144MA higher. The BBB is rising (raising the floor). The Christmas Cross lines show the red going sideways above the green line. The SRSI lines have been above the 80-level since early December. Both lines are now below my high yellow line. The red is currently below the green line and moving lower. The green line is also currently moving lower. The MACD lines are moving sideways to slightly lower with the red line barely below the green line The green DM line is cocked just below the 8-level and just above my super low yellow line at at 5.54. The 21MA is rising with no signs of starting to flatten at this point. There is a decline setting up of some significance sometime in the weeks ahead. This time-frame is ready to move lower but hasn’t started that at this point. Though not started here, the conditions of this chart are proving permission for more downward movement on smaller charts and reducing the permissions for upward movement. The Super-6 will end during the formation of this candle and earning season is starting."
            },
            "3-Day": {
                "1": "The candle is closed (day 3 of 3). This is a tiny white shooting star candle. The candles have been going sideways to slightly higher since the last of January. The up auto-wave is formed but not shifted to the right. The 21, 34, 55, 89, 144MAs are rising.  The 21MA is slowing it’s rise and may be starting to flatten. The 144 is crossing the 233MA higher. The TBB is flat to barely rising. The BBB is starting to flatten as well. The SRSI lines are close to the 20-level with the red crossing the green higher. The red line ending at 34.7 with the green flattening ending at 29.48. The MACD lines are moving sideways with the red line just under the green line. The green DM line is cocked well below the 8-level and just above my super low yellow line ending at 4.7. Though the 21MA may be begging to slow the rise or flatten, there isn’t any down movement underway on the time-frame at this point. To me, it looks to more of the same on this time-frame. In my opinion, though a down has not started on this time-frame, the conditions of this chart are slowly increasing the permissions for movement to the downside for smaller charts and reducing the permissions for upward movement. With Super-6 ending with the next 3-day candle closingbut earning season just starting a rise isn’t out of the question in the near future on this time-frame but nothing suggests it would be long-lasting."
            },
            "Daily": {
                "1": "Today the candle opened on my purple line and moved lower. The 21MA seems to be on a slight rise. The 34, 55, 89, 144, 233, and 377MAs are all pressing higher. The up auto-wave is formed but has not shifted to the right. The TBB is slightly rising but may be starting to flatten. The BBB is flat flat. The SRSI lines are above the 50-level. The red line has crossed above the green line ending at 65.64. The green line is still declining ending at 58.37. The MACD red line was moving higher above the green line but has now bent lower toward the rising green line. The red line closing at 279.2 with the green line at 260.71. The DE lines are in the noise. The larger charts are not opposed to a pull-back to test potential support and / or begin the flattening of their 21MA, however, with the DE lines in the noise here, Super-6, and the beginning of earnings season about to start, sideways seems most likely to me here right now. I wouldn’t be surprised to see some lower movement in the coming days but sideways (with Super-6 and earnings) seems probable. With earnings, a company with a big upside beat of earnings could easily pop the market up for a bit but there are just on permissions for a lasting upside movement to this market here. The Quarterly, Monthly, 8-Day, Weekly, and 3-Day green DM lines are all cocked. You must be aware of that 5-chart time-frame condition with the daily and 233-chart’s DM lines in the noise. I don’t see the conditions for any sustained rise at this moment here. There just are no permissions in place for any up movement to be sustained or extended."
            },
            "233": {
                "1": "Today the first candle opened and moved lower creating a red candle. The 2nd candle opened near the close of the first and moved a tiny bit higher closing as a white candle. The TBB is flat to slightly lower. The 21, 34, 55, 89, 144, and 233MAs are all rising. The BBB is also moving higher. The SRSI lines were above the 50-level. The red line crossed the green line lower ending at 48.62 with the green line flattening ending at 58.57. The red MACD line is moving lower below the green line closing at 164.94 with the green line also moving lower at 181.84. The DM lines are in the noise. To me, this looks like sideways movement finishing up Super-6. Remember, the start of earning season a big beat by a company or several upside reports could pop this market higher but there just isn’t anything supporting any extended upside movement at this point."
            },
            "144": {
                "1": "Today the first candle opened and moved lower creating a red candle. The 2nd  and last candles were just sideways as doji candles. The candles fell to the 21MA and then moved sideways along it. The up auto-wave has formed but has not shifted to the right. The 21MA looks to be starting to flatten. The TBB is flat. The BBB is flat to slightly starting to move lower. The SRSI lines are moving lower. Both are below the 50-level with the red now below the 20-level at 12.82. The MACD lines are moving lower with the red line below the green and increasing the distance. The DM lines are at the high side of the noisewith the red trying to turn higher toward the green. I wouldn’t be surprised to see a little more sideways or higher on this time-frame as we start the end of Super-6 next. With the green DM line cocked on the Quarterly, Monthly, 8-Day, Weekly, and 3-Day. The up permissions are not there so any rise is likely not going to be long lasting to the upside though earnings could provide a pop up to the market."
            }
        },
        "ADBE": {
            "Quarterly": {
                "1": "Today is the start of this candle (2nd quarterly candle for the year). So, today is simply the daily’s chart’s candle represented in the context of the quarterly chart time-frame. At this point we can’t really say anything about this specific candle. The previous candle opened on my purple line and moved lower. This candle opened at the close of the last and is red but that doesn’t mean anything to this point on this time-frame. The up auto-wave live formed more than 2-years ago and the down auto-wave has not formed yet. The candles appear to be putting in a double top (capital  “M”). The 21, 34, 55, 89, and 144MAs are all pressing higher. The BBB is also pressing higher. There are no signs the 21MA is beginning to flatten at this point. The SRSI has been rising from the 20-level. The red line has now bent and may be slightly moving lower. The SRSI lines may be forming a “Reverse Head & Shoulders” pattern, but think about it. This is a quarterly chart, it could take 1-3 years to form. The MACD red line trying to cross the green line lower. The green line appears to be trying to turn lower as well. The green DM line is just below 12 and moving sideways. There are some items here that suggest lower over time but again, it is a quarterly chart and will take 3-months just to complete this current candle."
            },
            "Monthly": {
                "1": "Today is the start of this candle. So, today is simply the daily’s chart’s candle represented in the context of the monthly chart time-frame. The up auto-wave line is formed but has not moved to the right at this point. The TBB is flattening. The candles have been moving lower toward a test of the slightly declining 34MA as potential support. The 21 and 55MAs are laminated and slightly rising under the 34MA. The 89, 144, and 233MAs are also rising. The SRSI lines are moving lower from above the 80-level with the red below that level and the green still above. The MACD lines are declining and the red is increasing the distance below the green line. The DM lines are in the noise. There are no permissions in place to go higher at this point on this time-frame. So, sideways to lower seems what the permissions are here currently."
            },
            "8-Day": {
                "1": "Today is day 5 of 8 for this candle. The candle is not completed but is currently a small red candle just below the rising 34MA. The down auto-wave is formed and hasn’t shifted to the right at this point. The candles have been declining below the now slightly declining 21MA. The previous candle closed on the rising 34MA. The current candle opened below the rising 34MA and moved lower. The TBB is flat to very slightly starting to rise while the BBB is starting to open lower. The 89MA is just below the BBB as potential support. The magnetic pull and fight between the 34 and 89MAs is currently underway. Below the 89MA the 144 and 55MA are laminated and sitting as potential support. The SRSI lines are both below the 20-level and declining with the red hitting my yellow line at 7.41and green line sitting at 17.98. The MACD lines are declining with the red line below the green line at 5.15 with the green at 20.47. The red DM line is near the cocked position but starting to flatten at 10.53. The 21MA is currently starting to decline with the candles already well below. So, until the 21 starts to flatten again, the pressure is to the downside. Currently everything on this chart and the permissions from the monthly and quarterly suggest a continued decline but at some point, a bounce upward to at least test potential resistance is coming. With the potential support below and the position of the SRSI and red DM line, after some sideways to lower, I wouldn’t be surprised to see a bounce on this chart time-frame. Bounce not a directional change. This is an 8-Day chart and it doesn’t change directions quickly (and the 21MA is just starting to decline). Perhaps the bounce is the result of earning season (though this symbols has already reported)."
            },
            "Weekly": {
                "1": "Today is a start of this candle (1 of 5). Today is just the daily candle’s movement represented in the context of this weekly chart time-frame. The candles have been moving sideways under the 55MA and one of my purple lines. The TBB is slightly rising. The BBB is opening lower (dropping the floor). The 21MA is declining. The 34MA is starting to decline. The 55MA is starting to flatten. The down auto-wave line has formed but has not shifted to the right. The 144, 233, and 89MAs are below the BBB as potential support. The SRSI lines are well below the 20-level. Both at at or just below by low yellow line. The red line is trying to cross the green line higher ending at 6.55 and the green at 6.39. The MACD lines have been declining with the red line now starting to decrease the distance betweenthe lines though not really moving higher at this point. The red DM line is cocked well below the 8-level at 6.95. Nothing on this chart suggests that an up is starting, however, the position of items on this chart indicate a bounce may be coming. There is nothing on the larger charts to say the up is starting at this time. So, though any smaller chart can move some up and down as needed, there are currently no permissions on the quarterly, monthly, 8-day, and weekly charts for an extended upward movement in place at this moment. There is a lot of potential support below the current levels, I wouldn’t be surprised to see some sideways to lower but also will not be surprised to see a bounce in the near future to test potential resistance before push back to current levels or below."
            },
            "3-Day": {
                "1": "The candle is now closed. It is a red candle and closed below the rising 89MA line. The TBB is flat to slightly rising. The BBB is declining. The down auto-wave line has formed but has not shifted to the right. The 21MA is declining. The 34MA appears to be declining as well. The 233MA is below the declining BBB as potential support. I have a declining wedge drawn on the SRSI connecting the tops of 11.29.203 and 02.08.24 and then the bottoms of 01.09.24 and 02.22.24. The SRSI lines are both below the 20-level with the red flat at “zero” and the green still declining at 11.34. The MACD red line is below the green line and moving parallel with the green line. The redDM line is trying to turn higher from a nearly cocked position. The 21MA is well above the current price. With normal daily movements for this symbol, it will likely take at least a few of these 3-Day candles to get to a test of the 21MA as potential resistance. Currently, the larger charts are indicating the decline may continue but there are showing signs that a bounce to test potential resistance levels may take place in the coming few weeks. I wouldn’t be surprised to see some sideways to lower perhaps closer toward the 233MA and then a bounce. As we finish up the Super-6, it’s earning season. Given that and the potential support below, bouncing around on the support levels from the monthly to this 3-Day chart to test potential resistance levels seems more likely than a big push higher in my opinion."
            },
            "Daily": {
                "1": "Today it opened and basically went no where ending as a tiny red candle on the bottom gap-down line (gap created on 3.15.24). After a bounce following earnings the candles have gone sideways along the bottom gap line since. The down auto-wave is formed and has not shifted to the right. The 21, 34, 55 and 89MAs are all declining. The 21MA is about to cross the 233MA lower and the 55MA is about to cross the 144MA lower. The TBB is turning lower. The BBB is declining. The SRSI lines are on top of each other moving sideways to slightly lower between the 80-level and 20-level. The MACD red line is on top of the green line moving slightly higher. The green line is flattening and possibly trying to turn higher as well. The DM lines are in the noise with both declining and the red below the green but not close to a cocked position. Currently, the 8-Day, weekly, and 3-Day charts are providing some permissions for some upside movement to test potential resistance areas (daily’s 233MA, gap-lines, and declining 21MA as examples). That said, these charts are still indicating that the decline isn’t over with. I wouldn’t be surprised to see some sideways movement and a bounce to test potential resistance areas and then likely moving lower again possible below the current level in the days ahead here. Though this stock has already reported earnings, any quality earnings releases (especially in the same industry) could pop the stock but beyond a test of resistance, I just don’t see anything that would extend any upside movement. Look at the 8-Day, weekly, 3-Day, and weekly 21MAs… nothing there shows any signs of flattening at this point."
            },
            "233": {
                "1": "The 1st candle today opened moved lower closing as a red candle. The 2nd candle opened at the close of the 1st and rose slightly ending as a small white candle. After a two day rise following earnings the candles gave up the gains and have moved sideways since. There is a Bollinger Band squeeze forming. The TBB and BBB are flat to slightly moving toward each other. The 21MA is basically flat. The 34, 55, 89, and 144MAs are all declining. The 144MA is crossing below the 233MA. The down auto-wave formed in the middle of March and has not shifted to the right but the up auto-wave hasn’t formed at this point either. The SRSI lines are moving higher from below the 50-level with the red line ending just below the 80-level at 79.45 and the green at 59.04. The MACD red line is above the green line moving sideways to slightly higher. The DM lines are in the noise. With the red DM line cocked on the and the position of the SRSI of the weekly and 3-Day being the only conditions for up, and the declining 21MAs from the weekly to this 233-chart. I wouldn’t be surprised to see sideways movement as we finish up with the Super-6 (aware that some positive earnings could blow the Bollinger Band squeeze to the upside.) Sideways seems most likely right now in my opinion."
            },
            "144": {
                "1": "Today the 1st candle opened on the declining 21MA, went down, and closed as a red candle. The 2nd candle opened and rose just a bit ending as a tiny white candle. The last candle opened and rose slightly more closing as an even smaller white candle. The down auto-wave has formed and is attached to the 2nd candle of today. The 21MA is slightly declining. The 34, 55, 89, 144, and 233MAs are all declining. The TBB is declining. The BBB is flat to slightly rising (squeeze). The SRSI lines are moving sideways above the 50-level with the red below the green and turning slightly higher. The MACD lines are almost on top of each other going sideways. The DM lines are in the noise (sideways). I wouldn’t be surprised to see sideways or slightly higher as we finish up Super-6.and start earning season movements. The permissions to rise from the bigger charts are not clear to this point, while the downside seems not done. So sideways seems like here in the middle of the week.We trade what the evidence shows what it is doing now, without getting caught in “what it has been doing” or “what we think will be coming next!” We have to assess and put the puzzle together objectively each day, on each candle close, and not get caught up in what has been or what we hope will be.The puzzle pieces that we have to add right now are Super-6 and the beginning of earning season while being aware that we are almost ¾ the way through the Transitional Movement Zone.Of course this is just Chart Watch. We have to be aware of the YTEI, the MTM, the MZ, the time of the month, and the historical movements of the stock or market."
            }
        }
    }
}